tutorial_cases/bubble_column_20L/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     birdmultiphaseEulerFoam;

startFrom       latestTime;//startTime;

startTime       0;

stopAt          writeNow;//endTime;

endTime         100;

deltaT          0.0001;

writeControl    adjustableRunTime;

writeInterval   2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;

maxDeltaT       0.0005;


functions
{

    #includeFunc    writeObjects(d.gas)
    #includeFunc    writeObjects(thermo:rho.gas)
    #includeFunc    writeObjects(thermo:rho.liquid)
    #includeFunc    writeObjects(thermo:mu.liquid)
    #includeFunc    writeObjects(thermo:mu.gas)

    fieldAverage
    {
        type            fieldAverage;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
    	timeStart       0;
        fields
        (
            alpha.gas
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }
        );
    };

}
//functions
//{
//    #includeFunc fieldAverage(U.air, U.water, alpha.air, p)
//}


// ************************************************************************* //
